Revit 2027 API
ItemData Properties
The ItemData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The internal name of the item.
ToolTip |  The tooltip of item.
Top
See Also
Reference
ItemData Class
Autodesk.Revit.UI Namespace